from random import sample
f = {'России': 'Москва', 'Украины':'Киев', 'Бельгии':'Брюссель', 'Греции':'Афины', 'Германии':'Берлин',
'Швейцарии':'Берн', 'Словакии':'Братислава', 'Польшы':'Варшава', 'Австрии':'Вена', 'Литвы':'Вильнюс', 'Ирландии':'Дублин', 'Хорватии':'Загреб', 'Дании':'Копенгаген', 'Великобритании':'Лондон', 'Белоруссии':'Минск'}
s = sample(f.keys(), 10)
print(s)
k = 0 
for el in s:
  s1 = []
  for el1 in f.values():
    if el1 != f[el]:
      s1.append(el1)
  s3 = sample(s1, 2)
  s3.append(f[el])
  s2 = list(set(s3))
  ot = int(input(f'Выберите столицу {el}\n1){s2[0]}; 2){s2[1]}; 3){s2[2]}\n'))
  if s2[ot - 1] == f[el]:
    k += 1
print(f'Ваш результат {k} из 10')
